	<?php require_once('app/header.php') ?>


		<div class="wrapper">

		
			<content class="content">

				
				<div class="error404">
					<img src="/public/img/error404.png">

					<h1> Причины возникновения 404 ошибки </h1>


<p> Типичной причиной такого сообщения является удаление или перемещение содержимого веб-сайта на новый URL-адрес. Но существуют и другие объяснения появления надписи
«404: Page Not Found»:</p>

<p> • URL-адрес веб-сайта или его содержимое были перемещены, либо полностью удалены (без соответствующей поправки внутренних ссылок).</p>

<p> • URL-адрес был изначально написан с ошибками (в процессе создания сайта или его реконструкции), неправильно указан или неверно введен в поисковую строку браузера.</p>

<p> • Сервер, связанный с веб-сайтом, временно не отвечает или соединение разорвано.</p>

<p> • Преобразование запрашиваемого доменного имени в IP-адрес сайта с помощью DNS-сервера (системы доменных имен) невозможно.</p>

<p> • Введенное доменное имя больше не существует.</p>

<p> Нерабочие ссылки могут оставаться в интернете в течение длительного времени, поскольку операторы не успевают вовремя отследить, что сайт и его содержимое уже удалены или перемещены. По этой причине множество давно удаленных или перемещенных на другой URL адрес веб-сайтов, как и прежде, видны на страницах результатов поиска, хотя доступа к ним больше нет (во всяком случае, не по заданному URL-адресу).</p>

				</div>


			</content>	


			<?php require_once ('app/sitebar.php'); ?>
				

		</div>

			
		<?php include('app/footer.php') ?>

	






